
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияНачала КАК ПериодДействияНачала,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияКонец КАК ПериодДействияКонец,
		|	РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот, ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот, Час) КАК
		|		КоличествоЧасов,
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Дата
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
			Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			   
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Документ не может быть проведен, договор должен быть с типом абонентское обслуживание"; 
				Сообщение.Сообщить(); 
				
			   Отказ = Истина;
			    
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.Дата <= ВыборкаДетальныеЗаписи.ПериодДействияНачала 
			         ИЛИ ВыборкаДетальныеЗаписи.Дата >= ВыборкаДетальныеЗаписи.ПериодДействияКонец Тогда
			         	
			     Сообщение = Новый СообщениеПользователю;
				 Сообщение.Текст = "Документ не может быть проведен, необходимо проверить сроки действия договора"; 
				 Сообщение.Сообщить(); 
				
			    Отказ = Истина;	
			         	
			КонецЕсли;
			
				Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.КоличествоЧасов;
				Движение.СуммакОплате = ВыборкаДетальныеЗаписи.КоличествоЧасов * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
				
		КонецЦикла;
	 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти




